/* No comment provided by engineer. */
" and %@" = " සහ %@";

/* elapsed time on recording screen, in seconds */
"%.1f sec" = "%.1f sec";

/* update notice when someone comments. %1$@ is the commenter name, %2$@ is the comment. */
"%1$@ commented: %2$@" = "%1$@ අදහස් දැක්වීය: %2$@";

/* update notice when someone suggests an ID. %1$@ is the username, %2$@ is the species. */
"%1$@ suggested an ID: %2$@" = "%1$@ හඳුනාගැනීමක් යෝජනා කළේය: %2$@";

/* confirmation alert text when changing a users network affiliation. %1%@ is network name, %2%@ is the country, %3%@ is the network name again */
"%@ is a member of the iNaturalist Network in %@. Local institutions supporting %@ will have access to your email address and access to the true coordinates for observations that are publicly obscured or private. Would you like to change your affiliation?" = "%1$@ යනු %2$@ හි iNaturalist ජාලයේ සාමාජිකයෙකි. %3$@ සඳහා සහය දක්වන දේශීය ආයතනවලට ඔබේ විද්‍යුත් තැපැල් ලිපිනයට ප්‍රවේශය සහ ප්‍රසිද්ධියේ අපැහැදිලි කළ හෝ පෞද්ගලික නිරීක්ෂණ සඳහා සත්‍ය ඛණ්ඩාංක වෙත ප්‍රවේශය ඇත. ඔබේ අනුබද්ධතාවය වෙනස් කිරීමට ඔබ කැමතිද?";

/* join iNat network partner alert message - %1%@ is the country name, %2%@ is partner name */
"%@ is part of the international iNaturalist Network. Would you like to join %@ to localize your experience of iNaturalist and share data with local institutions?" = "%1$@ යනු අන්තර්ජාතික iNaturalist ජාලයේ කොටසකි. iNaturalist පිළිබඳ ඔබේ අත්දැකීම් දේශීයකරණය කිරීමට සහ දේශීය ආයතන සමඟ දත්ත බෙදා ගැනීමට %2$@ හා සම්බන්ධ වීමට ඔබ කැමතිද?";

/* site news */
"%@ News" = "%@ පුවත්";

/* identification author attribution */
"%@'s ID" = "%@ ගේ හඳුනාගැනීම";

/* No comment provided by engineer. */
"%@, build %@" = "%1$@, ගොඩනැගීම %2$@";

/* Count of observations by this user, singular. */
"%d Observation" = "%d නිරීක්ෂණයක්";

/* Count of observations to upload, singular. */
"%d Observation To Upload" = "උඩුගත කිරීමට %d නිරීක්ෂණක්";

/* Count of observations by this user, plural. */
"%d Observations" = "නිරීක්ෂණ %d ක්";

/* Count of observations to upload, plural. */
"%d Observations To Upload" = "උඩුගත කිරීමට නිරීක්ෂණ %d ක්";

/* format string for showing positional accuracy in meters */
"%ld m" = "%ld m";

/* No comment provided by engineer. */
"'%@' requires that you fill out the '%@' field." = "ඔබ '%2$@' ක්ෂේත්‍රය පිරවීම '%1$@' සඳහා අවශ්‍යයි.";

/* positional accuracy when we don't know */
"???" = "???";

/* About button title in Settings
   About project button
   about the project header
   title of about screen */
"About" = "පිළිබඳව";

/* title for about section of the guide screen */
"ABOUT" = "පිළිබඳව";

/* about this project title */
"About this Project" = "මෙම ව්‍යාපෘතිය පිළිබඳව";

/* emphasis text for the 'switch to login mode' button. must be a substring of the base text */
"Account?" = "ගිණුම?";

/* No comment provided by engineer. */
"Activity" = "ක්‍රියාකාරකම්";

/* Title for add comment failed alert */
"Add Comment Failure" = "අදහස් එක් කරන්න අසමත් වීම";

/* Title for add ID failed alert */
"Add Identification Failure" = "හඳුනාගැනීම එක් කරන්න අසමත් වීම";

/* No comment provided by engineer. */
"Add to Favorites" = "ප්‍රියතමයන්ට එක් කරන්න";

/* Label for a button that adds an ID of the same taxon as the current one, so the sense is 'I agree with this identification' */
"Agree" = "එකඟ වන්න";

/* base text for the 'switch to login mode' button */
"Already have an Account?" = "දැනටමත් ගිණුමක් තිබේද?";

/* Status message when the database is unavailable and large parts of the app aren't working. Shouldn't happen, but fallback in case it ever does. */
"App is fatally misconfigured. Please contact help@inaturalist.org." = "App is fatally misconfigured. Please contact help@inaturalist.org.";

/* Title for app section of settings. */
"App Settings" = "යෙදුමේ සැකසුම්";

/* No comment provided by engineer. */
"Are you really sure?" = "ඔබට ඇත්තටම විශ්වාසද?";

/* No comment provided by engineer. */
"Are you sure you want to leave this project?" = "ඔබට මෙම ව්‍යාපෘතියෙන් ඉවත් වීමට අවශ්‍ය බව ඔබට විශ්වාසද?";

/* No comment provided by engineer. */
"Are you sure?" = "ඔබට විශ්වාසද?";

/* No comment provided by engineer. */
"Are you sure? This is permanent." = "ඔබට විශ්වාසද? මෙය ස්ථිරයි.";

/* argentina partner */
"Argentina: Fundación Vida Silvestre Argentina supporting ArgentiNat (www.argentinat.org)." = "ආර්ජන්ටිනාව: ArgentiNat (www.argentinat.org) ට සහාය දක්වන්නේ Fundación Vida Silvestre Argentina.";

/* australia partner */
"Australia: Atlas of Living Australia supporting iNaturalist Australia (inaturalist.ala.org.au/)." = "ඕස්ට්‍රේලියාව: iNaturalist Australia (inaturalist.ala.org.au/) ට සහාය දක්වන්නේ Atlas of Living Australia.";

/* label for autocomplete names switch in settings */
"Autocomplete names" = "නම් ස්වයං සම්පූර්ණ කිරීම";

/* label for auto upload switch in settings */
"Automatic upload" = "ස්වයංක්‍රීය උඩුගත කිරීම";

/* delete account confirmation */
"By deleting your account you will remove all of your observations, all of the identifications that you've added to the observations of others, and all comments that you've made. Furthermore, this action cannot be undone. If you change your mind later, you aren't getting any of that content back. If this site generates too many notifications, consider editing your settings to opt out of certain notifications or stop receiving email from us. If you're having trouble with a specific person on the site, consider muting them instead of deleting your account. If you are deleting your account because you tried to delete some of your content but you could still see it on a map or elsewhere on the Internet, keep in mind that map data may be cached for up to a day even after records are deleted, and that deleting content on this platform may not have any effect on copies that exist on other sites and platforms (like GBIF). If you're still sure you want to delete your account, enter '%@' in the form below and click the button to delete your account and all your data." = "By deleting your account you will remove all of your observations, all of the identifications that you've added to the observations of others, and all comments that you've made. Furthermore, this action cannot be undone. If you change your mind later, you aren't getting any of that content back. If this site generates too many notifications, consider editing your settings to opt out of certain notifications or stop receiving email from us. If you're having trouble with a specific person on the site, consider muting them instead of deleting your account. If you are deleting your account because you tried to delete some of your content but you could still see it on a map or elsewhere on the Internet, keep in mind that map data may be cached for up to a day even after records are deleted, and that deleting content on this platform may not have any effect on copies that exist on other sites and platforms (like GBIF). If you're still sure you want to delete your account, enter '%@' in the form below and click the button to delete your account and all your data.";

/* Base text for terms of service and privacy policy notice when creating an iNat account. */
"By using iNaturalist you agree to the Terms of Service and Privacy Policy." = "iNaturalist භාවිතා කිරීමෙන් ඔබ සේවා කොන්දේසි සහ රහස්‍යතා ප්‍රතිපත්තියට එකඟ වේ.";

/* vision assistance */
"CalTech and Cornell Tech helped develop the computer vision system that suggests identifications from photographs. We thank Grant Van Horn, Serge Belongie, and Pietro Perona for advancing the computer vision research. More information can be found at visipedia.org. Special thanks to NVIDIA for additional assistance." = "CalTech සහ Cornell Tech ඡායාරූප වලින් හඳුනාගැනීම් යෝජනා කරන පරිගණක දෘෂ්ටි පද්ධතිය සංවර්ධනය කිරීමට උපකාරී විය. පරිගණක දෘෂ්ටි පර්යේෂණ ඉදිරියට ගෙනයාම ගැන අපි Van Horn, Serge Belongie, සහ Pietro Perona ස්තූතිවන්ත වෙමු. වැඩි විස්තර visipedia.org වෙබ් අඩවියෙන් සොයා ගත හැකිය. අමතර සහාය සඳහා NVIDIA වෙත විශේෂ ස්තූතිය.";

/* Title for Camera button in media picker */
"Camera" = "Camera";

/* No comment provided by engineer. */
"Can't Add ID" = "හඳුනාගැනීම එක් කළ නොහැක";

/* No comment provided by engineer. */
"Can't Comment" = "අදහස් දැක්විය නොහැක";

/* No comment provided by engineer. */
"Can't Fave" = "ප්‍රියතමයක් කළ නොහැක";

/* Status message when the app can't start due to a corrupt database but the database doesn't exist. Shouldn't happen, but fallback in case it ever does. */
"Can't find realm database, can't continue. Please contact help@inaturalist.org." = "Can't find realm database, can't continue. Please contact help@inaturalist.org.";

/* Error message for when we can't retrieve your observations on Explore */
"Can't search for your observations right now. Please try later." = "ඔබගේ නිරීක්ෂණ සඳහා දැන්ම සෙවිය නොහැක. කරුණාකර පසුව උත්සාහ කරන්න.";

/* Status message when email is not configured on the phone so we can't send email on a user's behalf. */
"Can't send crash support email - please contact help@inaturalist.org." = "Can't send crash support email - please contact help@inaturalist.org.";

/* canada partner */
"Canada: Canadian Wildlife Federation, the Royal Ontario Museum, NatureServe Canada, and Parks Canada operating iNaturalist Canada (inaturalist.ca)." = "කැනඩාව: iNaturalist Canada (inaturalist.ca) මෙහෙයවනු ලබන්නේ Canadian Wildlife Federation, Royal Ontario Museum, NatureServe Canada, සහ Parks Canada.";

/* No comment provided by engineer. */
"Cancel" = "අවලංගු කරන්න";

/* Title of me header while cancellling an upload session. */
"Cancelling..." = "අවලංගු කරමින්...";

/* Alert message for invalid date */
"Cannot choose a date in the future." = "අනාගතයේ දිනයක් තෝරා ගත නොහැක.";

/* Failure message */
"Cannot donate" = "පරිත්‍යාග කළ නොහැක";

/* error when loading suggestions. %@ is the error message */
"Cannot load suggestions: %@" = "යෝජනා පූරණය කළ නොහැක: %@";

/* Store launch failure message */
"Cannot open store" = "වෙළඳසැල විවෘත කළ නොහැක";

/* Failure message */
"Cannot rate" = "ශ්‍රේණිගත කළ නොහැක";

/* No comment provided by engineer. */
"Cannot search iNaturalist.org" = "iNaturalist.org සෙවිය නොහැක";

/* Title of alert when the system is not configured for the user to send email */
"Cannot Send Email" = "විද්‍යුත් තැපෑල යැවිය නොහැක";

/* No comment provided by engineer. */
"Cannot use your location" = "ඔබගේ ස්ථානය භාවිතා කළ නොහැක";

/* Captive / cultivated button title. */
"Captive / Cultivated" = "අල්ලාගත් / වගා කළ";

/* message explaining what captive / cultivated means for iNaturalist */
"Captive / cultivated means that the organism exists where it was observed because humans intended it to be there. iNaturalist is about observing wild organisms, and our scientific data partners are not interested in observations of pets, gardens, or animals in zoos." = "අල්ලාගත් / වගා කළ යනු ජීවියා නිරීක්ෂණය කළ තැන එය පවතින්නේ මනුෂ්‍යයන් එය එහි තිබීමට අදහස් කළ නිසා බවයි. iNaturalist යනු වන ජීවීන් නිරීක්ෂණය කිරීම පිළිබඳව වන අතර අපගේ විද්‍යාත්මක දත්ත හවුල්කරුවන් සුරතල් සතුන්ගේ, උද්‍යානවල හෝ සත්වෝද්‍යානවල සතුන්ගේ නිරීක්ෂණ ගැන උනන්දු නොවේ.";

/* title for captive selector */
"Captive?" = "අල්ලාගත්?";

/* casual data quality */
"Casual Grade" = "අවිධිමත් ශ්‍රේණියේ";

/* label for change email address action in settings */
"Change email" = "විද්‍යුත් තැපෑල වෙනස් කරන්න";

/* No comment provided by engineer. */
"Change Email" = "විද්‍යුත් තැපෑල වෙනස් කරන්න";

/* No comment provided by engineer. */
"Change email address?" = "විද්‍යුත් තැපැල් ලිපිනය වෙනස් කරන්නද?";

/* label for change username action in settings */
"Change username" = "පරිශීලක නාමය වෙනස් කරන්න";

/* No comment provided by engineer. */
"Change Username" = "පරිශීලක නාමය වෙනස් කරන්න";

/* No comment provided by engineer. */
"Change username?" = "පරිශීලක නාමය වෙනස් කරන්නද?";

/* No comment provided by engineer. */
"Change your profile photo?" = "ඔබගේ පැතිකඩ ඡායාරූපය වෙනස් කරන්නද?";

/* Alert text for the license content checkbox during create account. */
"Check this box if you want to apply a Creative Commons Attribution-NonCommercial license to your photos. You can choose a different license or remove the license later, but this is the best license for sharing with researchers." = "ඔබේ ඡායාරූප සඳහා Creative Commons Attribution-NonCommercial (නිර්මාණශීලී පොදු ආරෝපණ-වාණිජ නොවන) බලපත්‍රයක් යෙදීමට අවශ්‍ය නම් මෙම කොටුව සලකුණු කරන්න. ඔබට පසුව වෙනත් බලපත්‍රයක් තෝරා ගැනීමට හෝ බලපත්‍රය ඉවත් කිරීමට හැකිය, නමුත් පර්යේෂකයන් සමඟ බෙදා ගැනීම සඳහා හොඳම බලපත්‍රය මෙයයි.";

/* title of alert after you reset your password
   title of email confirmation needed alert. */
"Check your email" = "ඔබගේ විද්‍යුත් තැපෑල පරීක්ෂා කරන්න";

/* chile partner */
"Chile: Ministerio del Medio Ambiente supporting iNaturalist Chile (inaturalist.mma.gob.cl)." = "චීලේ: iNaturalist Chile (inaturalist.mma.gob.cl) ට සහාය දක්වන්නේ Ministerio del Medio Ambiente. ";

/* No comment provided by engineer. */
"Choose from library" = "පුස්තකාලයෙන් තෝරන්න";

/* title of inat network picker */
"Choose iNat Network" = "iNat ජාලය තෝරන්න";

/* title for project observations chooser */
"Choose Projects" = "ව්‍යාපෘති තෝරන්න";

/* No comment provided by engineer. */
"Close" = "Close";

/* Collection type of project, which automatically collects observations into it. */
"Collection Project" = "එකතු කිරීමේ ව්‍යාපෘතිය";

/* colombia partner */
"Colombia: Instituto Humboldt operating Naturalista (colombia.inaturalist.org)." = "කොලොම්බියාව: Naturalista (colombia.inaturalist.org) මෙහෙයවනු ලබන්නේ Instituto Humboldt.";

/* No comment provided by engineer. */
"Comment" = "අදහස් දක්වන්න";

/* Button to contact support when app has failed to launch. */
"Contact Support" = "Contact Support";

/* label for contact support action in settings. */
"Contact support" = "උදවු සදහා අමතන්න";

/* Title for content hidden reason alert.
   when content has been moderated */
"Content Hidden" = "Content Hidden";

/* explanation for why a users content was moderated & hidden. First string is the moderator login, second is the date, third is the reason for the moderation. */
"Content hidden by %@ on %@ because: '%@'" = "Content hidden by %1$@ on %2$@ because: '%3$@'";

/* Title for About Content Licensing notice during signup */
"Content Licensing" = "අන්තර්ගත බලපත්‍ර ලබා දීම";

/* Button to copy the scientific name */
"Copy Scientific Name" = "විද්‍යාත්මක නම පිටපත් කරන්න";

/* Title of an alert dialog you see when you try to agree with an identification but cannot due to connection issues or other errors */
"Couldn't Agree" = "එකඟ වන්න නොහැකි විය";

/* Project validation error. first string is project title, second is the specific error */
"Couldn't be added to project %@. %@" = "%1$@ ව්‍යාපෘතියට එකතු කළ නොහැකි විය. %2$@";

/* No comment provided by engineer. */
"Couldn't determine your location" = "ඔබගේ ස්ථානය තීරණය කිරීමට නොහැකි විය";

/* HUD text when creating a new observation from multiple photos */
"Creating Observation..." = "Creating Observation...";

/* intro to credits section. */
"Credits" = "ගෞරව සම්මාන";

/* Title for danger zone (account deletion) section of settings. */
"Danger Zone" = "Danger Zone";

/* Header for data quality section of obs detail */
"Data Quality" = "දත්තවල ගුණාත්මකභාවය";

/* Title for About Data Transfer notice during signup */
"Data Transfer" = "Data Transfer";

/* No comment provided by engineer. */
"Default" = "පෙරනිමි";

/* button title to delete account */
"Delete Account" = "Delete Account";

/* button to  delete a locally downloaded species guide. */
"Delete download" = "බාගැනීම මකන්න";

/* No comment provided by engineer. */
"Delete Error" = "දෝෂය මකන්න";

/* Button to delete the database. This will appear in red as a destructive action. */
"Delete Local Database and Try Again" = "Delete Local Database and Try Again";

/* text of delete obs button */
"Delete Observation" = "නිරීක්ෂණය මකන්න";

/* Deletes pending sync. */
"Deletes To Sync" = "සමමුහුර්ත කිරීමට ඇති දෑ මකයි";

/* title for description section of the guide screen */
"DESCRIPTION" = "විස්තරය";

/* Title for confirm new observation details view */
"Details" = "සවිස්තර";

/* Status message when the user tapped contact support but then chose to not allow us to send a support email on their behalf. */
"Didn't send crash support email - please contact help@inaturalist.org." = "Didn't send crash support email - please contact help@inaturalist.org.";

/* Button to cancel showing tutorial screens when visiting new tabs */
"Don't Show Me Hints" = "මට ඉඟි පෙන්වන්න එපා";

/* label for iNaturalist donate call to action. */
"Donate to iNaturalist" = "Donate to iNaturalist";

/* title for done button */
"Done" = "Done";

/* No comment provided by engineer. */
"Download" = "බාගත කරන්න";

/* title for button that allows a user to download a species guide and use it while offline. */
"Download for offline use" = "මාර්ගගත නොවී භාවිතය සඳහා බාගත කරගන්න";

/* No comment provided by engineer. */
"Download not available" = "බාගත කිරීම ලබා ගැනීමට නොතිබේ";

/* notice that a species guide has been downloaded from the server and can be used while offline. */
"Downloaded" = "බාගත කළ";

/* Notice when we're downloading a species guide from the server, to be used offline */
"Downloading..." = "බාගත කරමින්...";

/* ecuador partner */
"Ecuador: Instituto Nacional de Biodiversidad (INABIO) supporting iNaturalist Ecuador (ecuador.inaturalist.org)." = "ඉක්වදෝරය: iNaturalist Ecuador (ecuador.inaturalist.org) ට සහාය දක්වන්නේ Instituto Nacional de Biodiversidad (INABIO). ";

/* The editor or author of the species guide */
"Editor" = "සංස්කාරක";

/* message for the alert when a guide download fails, if we can't extract an error message. */
"Either there was an error on the server or the guide no longer exists." = "එක්කෝ සේවාදායකයේ දෝෂයක් ඇතිවිය හෝ මාර්ගෝපදේශය තවදුරටත් නොපවතී.";

/* label for email field in settings */
"Email" = "විද්‍යුත් තැපෑල";

/* Title for error alert */
"Error" = "දෝෂය";

/* failure title when changing a setting. */
"Error changing setting." = "සැකසුම වෙනස් කිරීමේ දෝෂයකි.";

/* No comment provided by engineer. */
"Error Fetching Observations" = "නිරීක්ෂණ ලබා ගැනීමේ දෝෂයකි";

/* error loading leaderboard title */
"Error loading leaderboard" = "ප්‍රමුඛ පුවරුව පූරණය කිරීමේ දෝෂයකි";

/* basis for a suggestion */
"Expected Nearby" = "Expected Nearby";

/* No comment provided by engineer. */
"Explore" = "ගවේෂණය කරන්න";

/* Status message when the user tries to delete the DB but it fails. */
"Failed to delete database. Please contact help@inaturalist.org." = "Failed to delete database. Please contact help@inaturalist.org.";

/* title of alert when a guide download fails. a localized error message provided by iOS or the server follows. */
"Failed to download guide" = "මාර්ගෝපදේශය බාගත කිරීමට අපොහොසත් විය";

/* Unknown iNat login error */
"Failed to log in to iNaturalist. Please try again." = "Failed to log in to iNaturalist. Please try again.";

/* title of alert when sound recording fails */
"Failed to Record" = "Failed to Record";

/* No comment provided by engineer. */
"Failed to save guide" = "මාර්ගෝපදේශය සුරැකීමට අපොහොසත් විය";

/* title of alert when sound recording setup fails */
"Failed to Setup Sound Recording" = "Failed to Setup Sound Recording";

/* No comment provided by engineer. */
"Faved" = "ප්‍රියතමයක් කළා";

/* No comment provided by engineer. */
"Faves" = "Faves";

/* No comment provided by engineer. */
"Featured" = "විශේෂාංග ගත";

/* This is an explanation for when auth token fetch fails during upload/sync. */
"Fetching an authentication token failed. Please contact help@inaturalist.org and try later." = "සත්‍යාපන ටෝකනයක් ලබා ගැනීම අසාර්ථක විය. කරුණාකර help@inaturalist.org හා සම්බන්ධ වී පසුව උත්සාහ කරන්න.";

/* No comment provided by engineer. */
"Fetching recent observations in map area" = "සිතියම් ප්‍රදේශයේ මෑත කාලීන නිරීක්ෂණ ලබා ගනිමින්";

/* No comment provided by engineer. */
"Fetching recent observations worldwide" = "ලොව පුරා මෑත කාලීන නිරීක්ෂණ ලබා ගනිමින්";

/* No comment provided by engineer. */
"Find locations named '%@'" = "Find locations named '%@'";

/* No comment provided by engineer. */
"Find my observations" = "මගේ නිරීක්ෂණ සොයන්න";

/* No comment provided by engineer. */
"Find observations near me" = "මා අසල ඇති නිරීක්ෂණ සොයන්න";

/* No comment provided by engineer. */
"Find organisms named '%@'" = "Find organisms named '%@'";

/* No comment provided by engineer. */
"Find people named '%@'" = "Find people named '%@'";

/* No comment provided by engineer. */
"Find projects named '%@'" = "Find projects named '%@'";

/* No comment provided by engineer. */
"Finding your location..." = "ඔබේ ස්ථානය සොයා ගනිමින්...";

/* finland partner */
"Finland: Finnish Museum of Natural History (Luomus) supporting iNaturalist Finland (https://inaturalist.laji.fi)." = "Finland: Finnish Museum of Natural History (Luomus) supporting iNaturalist Finland (https://inaturalist.laji.fi).";

/* Title for forgot password button. */
"Forgot password?" = "මුරපදය අමතක වුණාද?";

/* Geoprivacy button title */
"Geoprivacy" = "භූ-රහස්‍යතාව";

/* No comment provided by engineer. */
"Go Back" = "ආපසු යන්න";

/* Button to dismiss a tutorial screen */
"Got It" = "තේරුම් ගත්තා";

/* greece partner */
"Greece: iSea supporting iNaturalist Greece (greece.iNaturalist.org)." = "Greece: iSea supporting iNaturalist Greece (greece.iNaturalist.org).";

/* Grid layout on explore tab */
"Grid" = "Grid";

/* No comment provided by engineer. */
"Guide download error" = "මාර්ගෝපදේශය බාගත කිරීමේ දෝෂයකි";

/* No comment provided by engineer. */
"Guide editor must enable this feature." = "මාර්ගෝපදේශයේ සංස්කාරක මෙම අංගය සක්‍රීය කළ යුතුය.";

/* accessibility label for guides button */
"Guides" = "මාර්ගෝපදේශ";

/* Subtitle above image for guides tutorial screen */
"Guides are created and shared by the iNaturalist community" = "මාර්ගෝපදේශ නිර්මාණය කරනු ලබන්නේ සහ බෙදාගනු ලබන්නේ iNaturalist ප්‍රජාව විසිනි";

/* Title for guides tutorial screen */
"Guides are lists of species" = "මාර්ගෝපදේශ යනු විශේෂවල ලැයිස්තුය";

/* Part of the text summarizing an observation spoken by a screen reader indicating whether an observation has photos */
"Has Photos" = "Has Photos";

/* Part of the text summarizing an observation spoken by a screen reader indicating whether an observation has sounds */
"Has Sounds" = "Has Sounds";

/* Title for help section of settings. */
"Help" = "උදව්";

/* No comment provided by engineer. */
"Here are our top suggestions:" = "Here are our top suggestions:";

/* personal info consent checkbox label */
"I consent to allow iNaturalist to store and process limited kinds of personal information about me in order to manage my account." = "I consent to allow iNaturalist to store and process limited kinds of personal information about me in order to manage my account.";

/* data transfer consent checkbox label */
"I consent to allow my personal information to be transferred to the United States of America." = "I consent to allow my personal information to be transferred to the United States of America.";

/* Title of identification failure alert */
"Identification Failed" = "හඳුනා ගැනීම අසාර්ථක විය";

/* Title for taxon section when adding an ID */
"Identification Taxon" = "හඳුනාගැනීමේ තක්සෝනය";

/* No comment provided by engineer. */
"Identifications" = "හඳුනාගැනීම්";

/* No comment provided by engineer. */
"Identifiers" = "හඳුනාගත්තන්";

/* body of alert after you reset your password */
"If the email address you entered is associated with an iNaturalist account, you should receive an email at that address with a link to reset your password." = "ඔබ ඇතුළත් කළ විද්‍යුත් තැපැල් ලිපිනය iNaturalist ගිණුමක් සමඟ සම්බන්ධ වී ඇත්නම්, ඒ ලිපිනයට ඔබගේ මුරපදය නැවත සැකසීමට සබැඳියක් සහිත විද්‍යුත් තැපැල් පණිවිඩයක් ඔබට ලැබිය යුතුය.";

/* message of alert when mic permission is missing */
"If you wish to record a sound observation, you will need to give the iNaturalist app permission to use the microphone." = "If you wish to record a sound observation, you will need to give the iNaturalist app permission to use the microphone.";

/* Message when we can't make the image store for the app */
"ImageStore Creation Error" = "ImageStore Creation Error";

/* Message when we can't save to the app image store */
"ImageStore Save Error" = "ImageStore Save Error";

/* No comment provided by engineer. */
"in project '%@'" = "'%@' ව්‍යාපෘතියේ";

/* alert title for camera denied */
"iNaturalist doesn't have permission to access your camera." = "iNaturalist doesn't have permission to access your camera.";

/* inat core team, alphabetically */
"iNaturalist exists thanks to every single person who participates in our community. The people who build the software, design the interfaces, maintain our infrastructure, support the community, and foster collaborations are Yaron Budowski, Amanda Bullington, Tony Iwane, Johannes Klein, Patrick Leary, Scott Loarie, Abhas Misraraj, Sylvain Morin, Carrie Seltzer, Alex Shepard, Angie Ta, and Ken-ichi Ueda." = "iNaturalist exists thanks to every single person who participates in our community. The people who build the software, design the interfaces, maintain our infrastructure, support the community, and foster collaborations are Yaron Budowski, Amanda Bullington, Tony Iwane, Johannes Klein, Patrick Leary, Scott Loarie, Abhas Misraraj, Sylvain Morin, Carrie Seltzer, Alex Shepard, Angie Ta, and Ken-ichi Ueda.";

/* alert title for camera restricted */
"iNaturalist has been restricted from camera access." = "iNaturalist has been restricted from camera access.";

/* inat independent org statement */
"iNaturalist is an independent 501(c)(3) nonprofit based in the United States (EIN 92-1296468)" = "iNaturalist is an independent 501(c)(3) nonprofit based in the United States (EIN 92-1296468)";

/* label for inaturalist network action in settings */
"iNaturalist Network" = "iNaturalist ජාලය";

/* Category of iNaturalist places for place search */
"iNaturalist Places" = "iNaturalist Places";

/* open source contributions */
"iNaturalist uses Glyphish icons by Joseph Wain, ionicons by Ben Sperry, and icons by Luis Prado and Roman Shlyakov from the Noun Project. iNaturalist is also deeply grateful to the Cocoapods community, and to the contributions of our own open source community. See https://github.com/inaturalist/INaturalistIOS." = "iNaturalist විසින් Joseph Wain ගේ Glyphish icons, Ben Sperry ගේ ionicons, සහ Luis Prado ගේ icons සහ Noun Project හි Roman Shlyakov භාවිතා කරයි. එමෙන්ම Cocoapods ප්‍රජාවට සහ අපගේම විවෘත මූලාශ්‍ර ප්‍රජාවේ දායකත්වයට iNaturalist බෙහෙවින් කෘතඥ වෙනවා. https://github.com/inaturalist/INaturalistIOS බලන්න.";

/* Error msg when we get a 401 from the server */
"Incorrect username or password." = "පරිශීලක නාමය හෝ මුරපදය වැරදියි.";

/* No comment provided by engineer. */
"Info" = "Info";

/* No comment provided by engineer. */
"Internet connection required" = "අන්තර්ජාල සම්බන්ධතාවය අවශ්‍යයි";

/* No comment provided by engineer. */
"Internet required" = "අන්තර්ජාලය අවශ්‍යයි";

/* title of autoupload introduction alert view */
"Introducing Auto Upload!" = "ස්වයං උඩුගත කිරීම හඳුන්වා දීම!";

/* Invalid date alert title */
"Invalid Date" = "වලංගු නැති දිනයක්";

/* Error for bad email when making account. */
"Invalid Email Address" = "වලංගු නැති විද්‍යුත් තැපැල් ලිපිනයක්";

/* Unknown invalid input */
"Invalid input" = "වලංගු නැති ආදානයක්";

/* No comment provided by engineer. */
"Invalid Location" = "වලංගු නැති ස්ථානයක්";

/* Error for bad username when making account. */
"Invalid Username" = "වලංගු නැති පරිශීලක නාමයක්";

/* israel partner */
"Israel: University of Haifa supporting iNaturalist Israel (israel.inaturalist.org)." = "ඊශ්‍රායලය: iNaturalist Israel (israel.inaturalist.org) ට සහාය දක්වන්නේ University of Haifa. ";

/* iucn places credit */
"IUCN category II places provided by IUCN and UNEP-WCMC (2015), The World Database on Protected Areas (WDPA) [On-line], [11/2014], Cambridge, UK: UNEP-WCMC. Available at: www.protectedplanet.net." = "II කාණ්ඩයේ IUCN ස්ථාන IUCN සහ UNEP-WCMC (2015) විසින් සපයනු ලැබේ, ආරක්ෂිත ප්‍රදේශ පිළිබඳ ලෝක දත්ත සමුදාය (The World Database on Protected Areas (WDPA)) [On-line], [11/2014], Cambridge, UK: UNEP-WCMC. මෙතැනින් ලබා ගත හැකියි: www.protectedplanet.net.";

/* Join project button */
"Join" = "එක්වන්න";

/* join iNat network partner alert title */
"Join %@?" = "%@ ට එක්වන්නද?";

/* Subtitle above image for projects tutorial screen */
"Join projects to select them when you record observations" = "ඔබ නිරීක්ෂණ පටිගත කරන විට ව්‍යාපෘති තෝරා ගැනීමට එවා හා සම්බන්ධ වන්න";

/* No comment provided by engineer. */
"Joined" = "සම්බන්ධ විය";

/* No comment provided by engineer. */
"Joining..." = "එකතු වෙමින්…";

/* visualization of latitude/longitude/accuracy */
"Lat: %.5f Long: %.5f Acc: %@" = "අක්ෂාංශ: %1$.5f දේශාංශ: %2$.5f නිරවද්‍යතාවය: %3$@";

/* format string for showing latitude, longitude, & positional accuracy */
"Lat: %1$@, Long: %2$@, Acc: %3$@" = "Lat: %1$@, Long: %2$@, Acc: %3$@";

/* Title for leaderboard page. */
"Leaderboard" = "ප්‍රමුඛ පුවරුව";

/* button to learn more about inat account policies */
"Learn More" = "Learn More";

/* learn more (about network partner changes) button text */
"Learn more" = "වැඩිදුර ඉගෙන ගන්න";

/* No comment provided by engineer. */
"Learn more about data quality >" = "දත්තවල ගුණාත්මකභාවය පිළිබඳව වැඩිදුර ඉගෙන ගන්න >";

/* Leave project button */
"Leave" = "ඉවත් වන්න";

/* No comment provided by engineer. */
"Leaving..." = "ඉවත් වෙමින්...";

/* The license of the species guide */
"License" = "බලපත්‍රය";

/* List layout on explore tab */
"List" = "List";

/* No comment provided by engineer. */
"Loading..." = "පූරණය වෙමින්...";

/* No comment provided by engineer. */
"Location Fetch Error" = "ස්ථානය ලබා ගැනීමේ දෝෂයකි";

/* No comment provided by engineer. */
"Location Services Denied" = "ස්ථාන සේවා ප්‍රතික්ෂේප විය";

/* No comment provided by engineer. */
"Location Services Restricted" = "ස්ථාන සේවා සීමා කර ඇත";

/* Title for button that allows users to log in to their existing iNat account */
"Log In" = "ඇතුල් වන්න";

/* No comment provided by engineer. */
"Log In / Sign Up" = "ඇතුල් වන්න / ලියාපදිංචි වන්න";

/* No comment provided by engineer. */
"Log in and upload this observation to enable comments & identifications." = "Log in and upload this observation to enable comments & identifications.";

/* No comment provided by engineer. */
"Log in to enable faves." = "Log in to enable faves.";

/* Notice while we're logging in */
"Logging in..." = "Logging in...";

/* placeholder text for taxon search bar */
"Look up a species by name" = "නමින් විශේෂයක් සොයා බලන්න";

/* unknown taxon subtitle when suggestions are unavailable */
"Look up species name" = "විශේෂයක නමක් සොයා බලන්න";

/* No comment provided by engineer. */
"Looks like there was an error: %@" = "දෝෂයක් ඇති බව පෙනේ: %@";

/* Notice to display to the user on the Me tab when they have no observations */
"Looks like you have no observations." = "ඔබට නිරීක්ෂණ කිසිවක් නොමැති බව පෙනේ.";

/* label for app store rating action in settings. */
"Love iNat? Rate us" = "iNat ට ආදරෙයිද? අපිව අගය කරන්න";

/* luxembourg partner */
"Luxembourg: Luxembourg National Museum of Natural History (MnhnL) supporting iNaturalist Luxembourg (inaturalist.lu)." = "Luxembourg: Luxembourg National Museum of Natural History (MnhnL) supporting iNaturalist Luxembourg (inaturalist.lu).";

/* No comment provided by engineer. */
"Make sure iNat has permission to access your location or give the GPS some time to fetch it." = "ඔබගේ ස්ථානයට ප්‍රවේශ වීමට iNat හට අවසර ඇති බවට වග බලා ගන්න හෝ එය ලබා ගැනීමට GPS හට යම් කාලයක් ලබා දෙන්න.";

/* title for action sheet allowing user to delete a locally downloaded guide. */
"Manage download" = "බාගත කිරීම කළමනාකරණය කරන්න";

/* Map layout on explore tab */
"Map" = "Map";

/* No comment provided by engineer. */
"Map of Observations" = "නිරීක්ෂණ සිතියම";

/* Placeholder text for not logged title on me tab. */
"Me" = "මම";

/* mexico partner */
"Mexico: Comisión nacional para el conocimiento y uso de la biodiversidad (CONABIO) operating NaturaLista (NaturaLista.mx)." = "මෙක්සිකෝව: NaturaLista (NaturaLista.mx) මෙහෙයවනු ලබන්නේ Comisión nacional para el conocimiento y uso de la biodiversidad (CONABIO).";

/* Title for alert when db migration fails. */
"Migration Failed" = "සංක්‍රමණය අසාර්ථක විය";

/* Title for alert when db migration had a problem. */
"Migration Problem" = "සංක්‍රමණ ගැටලුවක්";

/* No comment provided by engineer. */
"Missing Date" = "දිනය මඟහැරී ඇත";

/* No comment provided by engineer. */
"Missing Location" = "ස්ථානය මඟහැරී ඇත";

/* No comment provided by engineer. */
"Missing Required Field" = "අවශ්‍ය ක්ෂේත්‍රයක් මඟහැරී ඇත";

/* No comment provided by engineer. */
"My Content" = "මගේ අන්තර්ගතය";

/* No comment provided by engineer. */
"named '%@ (%@)'" = "'%1$@ (%2$@)' ලෙස නම් කළ";

/* No comment provided by engineer. */
"named '%@'" = "'%@' ලෙස නම් කළ";

/* No comment provided by engineer. */
"Nearby" = "අසල ඇති";

/* No comment provided by engineer. */
"Nearby Suggestions Filter" = "Nearby Suggestions Filter";

/* needs id data quality */
"Needs ID" = "හඳුනාගැනීම අවශ්‍යයි";

/* subtitle for an observation that failed validation. */
"Needs Your Attention" = "ඔබේ අවධානය අවශ්‍යයි";

/* Network (i.e. an Internet connection) is required error message */
"Network is required." = "ජාලය අවශ්‍ය වේ.";

/* No comment provided by engineer. */
"Network unavailable" = "ජාලය ලබා ගත නොහැක";

/* No comment provided by engineer. */
"Network Unavailable" = "ජාලය ලබා ගත නොහැක";

/* decline to change cemra permissions button title */
"Never mind" = "ගණන් ගන්න එපා";

/* Part of the text summarizing an observation spoken by a screen reader indicating whether an observation has new activity */
"new activity" = "new activity";

/* base text for the 'switch to signup mode' button */
"New to iNaturalist? Sign up now!" = "iNaturalist ට අලුත්ද? දැන්ම ලියාපදිංචි වන්න!";

/* nz partner */
"New Zealand: New Zealand Biodiversity Recording Network operating iNaturalist NZ — Mātaki Taiao (inaturalist.nz)." = "නවසීලන්තය: iNaturalist NZ — Mātaki Taiao (inaturalist.nz) මෙහෙයවනු ලබන්නේ New Zealand Biodiversity Recording Network.";

/* News project button */
"News" = "පුවත්";

/* Confirm a new photo */
"NEXT" = "ඊලඟ";

/* Generic negative response to a yes/no question
   negative response to binary choice, yes or no */
"No" = "නැහැ";

/* No comment provided by engineer. */
"No description" = "විස්තරයක් නොමැත";

/* No comment provided by engineer. */
"No iNaturalist Results" = "iNaturalist ප්‍රතිඵල නොමැත";

/* place guess when we have no location information */
"No location" = "ස්ථානයක් නොමැත";

/* No comment provided by engineer. */
"No matching taxa" = "ගැලපෙන තක්සෝන නොමැත";

/* Title for No Media button in media picker */
"No Media" = "No Media";

/* title of alert when user tries to record a sound observation without granting mic permissions */
"No Microphone Permissions" = "No Microphone Permissions";

/* No comment provided by engineer. */
"No network connection." = "ජාල සම්බන්ධතාවයක් නොමැත.";

/* No comment provided by engineer. */
"No network connection. :(" = "ජාල සම්බන්ධතාවයක් නොමැත. :(";

/* Header observation count title when there are none. */
"No Observations" = "නිරීක්ෂණ නොමැත";

/* Error notice when exploring observations, when no obserations were found within a map area. */
"No observations found in map area." = "සිතියම් ප්‍රදේශයෙන් නිරීක්ෂණ හමු නොවීය.";

/* Error notice when exploring observations when no observations were found. */
"No observations found." = "නිරීක්ෂණ කිසිවක් හමු නොවීය.";

/* No comment provided by engineer. */
"No observations yet." = "තවමත් නිරීක්ෂණ නොමැත.";

/* No comment provided by engineer. */
"No Photos or Sounds and Missing Identification" = "No Photos or Sounds and Missing Identification";

/* No comment provided by engineer. */
"No such organisms found. :(" = "එවැනි ජීවීන් හමු නොවීය. :(";

/* No comment provided by engineer. */
"No such person found. :(" = "එවැනි පුද්ගලයෙකු හමු නොවීය. :(";

/* No comment provided by engineer. */
"No such place found. :(" = "එවැනි ස්ථානයක් හමු නොවීය. :(";

/* No comment provided by engineer. */
"No such project found. :(" = "එවැනි ව්‍යාපෘතියක් හමු නොවීය. :(";

/* No comment provided by engineer. */
"No Thanks" = "එපා ස්තුතියි";

/* No comment provided by engineer. */
"No updates yet. Stay tuned!" = "තවම යාවත්කාලීන කිරීම් නොමැත. සුසරව සිටින්න!";

/* No comment provided by engineer. */
"No URL configured" = "URL එකක් වින්‍යාස කර නොමැත";

/* do not change network partner button */
"No, don’t change my affiliation" = "නැත, මගේ අනුබද්ධතාවය වෙනස් නොකරන්න";

/* No comment provided by engineer. */
"None, all rights reserved" = "කිසිවක් නැත, සියලුම හිමිකම් ඇවිරිණි";

/* No comment provided by engineer. */
"Not Allowed" = "අවසර නැත";

/* 403 unauthorized title */
"Not Authorized" = "අවසර නැත";

/* Placeholder for observation notes when making a new observation. */
"Notes..." = "සටහන්...";

/* Observation option for explore leaderboard sorting. Must be short. */
"Obs" = "නිරීක්ෂණ";

/* obscured geoprivacy */
"Obscured" = "අපැහැදිලි කළ";

/* accessibility label for obs (date, title, subtitle, media, new activity) */
"Observation %@ %@ %@ %@ %@" = "Observation %1$@ %2$@ %3$@ %4$@ %5$@";

/* Project validation error, with the specific error */
"Observation Field Validation error: %@" = "නිරීක්ෂණ ක්ෂේත්‍රය වලංගු කිරීමේ දෝෂයකි: %@";

/* No comment provided by engineer. */
"Observations" = "නිරීක්ෂණ";

/* observation count on the explore leaderboard. */
"Observations: %ld" = "Observations: %ld";

/* observation count on explore leaderboard when the user has species but not observations in the leaderboard. */
"Observations: *" = "Observations: *";

/* Title for New Observation Tab Bar Button */
"Observe" = "Observe";

/* No comment provided by engineer. */
"Observers" = "නිරීක්ෂකයෝ";

/* No comment provided by engineer. */
"OK" = "හරි";

/* Title error with oops text. */
"Oops" = "අපොයි";

/* open geoprivacy */
"Open" = "විවෘත කරන්න";

/* No comment provided by engineer. */
"Open link in Safari" = "Safari තුළ සබැඳිය විවෘත කරන්න ";

/* button to open settings when user needs to adjust mic permissions
   open settings button title */
"Open Settings" = "Open Settings";

/* panama partner */
"Panama: Ministerio de Ambiente operating iNaturalistPa (panama.inaturalist.org)." = "පැනමාව: iNaturalistPa (panama.inaturalist.org) මෙහෙයවනු ලබන්නේ Ministerio de Ambiente.";

/* Error for bad password when making account */
"Passwords must be at least six characters in length." = "මුරපදවල දිග අවම වශයෙන් අක්ෂර හයක්වත් තිබිය යුතුය.";

/* Accessibility Label for Pause Button (when recording audio) */
"Pause" = "Pause";

/* No comment provided by engineer. */
"Paused" = "Paused";

/* No comment provided by engineer. */
"Permission denied" = "අවසරය ප්‍රතික්ෂේප කෙරිණි";

/* Title for About Personal Information notice during signup */
"Personal Information" = "Personal Information";

/* Title for Photo Library button in media picker */
"Photo Library" = "Photo Library";

/* Title for photo library error when making new obs
   Title for photo library fetch error when making new obs
   Title for photo load error alert msg */
"Photo Load Error" = "ඡායාරූපය පූරණය කිරීමේ දෝෂයකි";

/* Title for photo save error alert msg */
"Photo Save Error" = "ඡායාරූපය සුරැකීමේ දෝෂයකි";

/* Title for photos error alert msg */
"Photos Error" = "ඡායාරූප දෝෂයකි";

/* No comment provided by engineer. */
"Placeholder" = "ස්ථාන දරන්නා";

/* helpful note about observations and collection projects on the screen where you can add observations to projects. */
"Please note: Observations will be automatically included in a collection project if they meet its requirements." = "කරුණාකර සටහන් කරගන්න: නිරීක්ෂණ, එකතු කිරීමේ ව්‍යාපෘතියක අවශ්‍යතා සපුරාලන්නේ නම් ඒවා එයට ස්වයංක්‍රීයව ඇතුළත් වනු ඇත.";

/* No comment provided by engineer. */
"Please pick a valid location." = "කරුණාකර වලංගු ස්ථානයක් තෝරන්න.";

/* Error message for the user, when the geocoder is telling us to slow down. */
"Please try again in a few moments." = "කරුණාකර සුළු මොහොතකින් නැවත උත්සාහ කරන්න.";

/* failure message when the user should just try again. */
"Please try again later." = "කරුණාකර පසුව උත්සාහ කරන්න";

/* alert msg to change camera permissions */
"Please update camera permissions to take photos with iNaturalist" = "Please update camera permissions to take photos with iNaturalist";

/* No comment provided by engineer. */
"Please upload to determine data quality" = "දත්තවල ගුණාත්මකභාවය තීරණය කිරීමට කරුණාකර උඩුගත කරන්න";

/* portugal partner */
"Portugal: Associação Biodiversidade Para Todos operating Biodiversity4All (Biodiversity4All.org)." = "පෘතුගාලය: Biodiversity4All (Biodiversity4All.org) මෙහෙයවනු ලබන්නේ Associação Biodiversidade Para Todos.";

/* label for a news post author */
"Posted by" = "පළ කළේ";

/* label for prefer no tracking switch in settings */
"Prefer No Tracking" = "ලුහුබැඳීම්වලට කැමති නැත";

/* title for consent screen */
"Privacy" = "Privacy";

/* Emphasized part of the privacy base text. */
"Privacy Policy" = "රහස්‍යතා ප්‍රතිපත්තිය";

/* private geoprivacy */
"Private" = "පෞද්ගලික";

/* choose projects button title. */
"Projects" = "ව්‍යාපෘති";

/* Title for projects tutorial screen */
"Projects are collections of observations with a common purpose" = "ව්‍යාපෘති යනු පොදු අරමුණක් සහිත නිරීක්ෂණවල එකතුවන්ය.";

/* No comment provided by engineer. */
"Pull to Refresh" = "නැවුම් කිරීමට අදින්න";

/* Rank in an ordered list */
"Rank" = "තරාව";

/* action to re-download a species guide from the server */
"Re-download" = "නැවත බාගත කරන්න";

/* Accessibility Label for Record Button (when recording audio)
   Accessibility Label for Record/Pause Button */
"Record" = "Record";

/* Title for Record sound button in media picker */
"Record Sound" = "Record Sound";

/* Accessibility label for sound recorder */
"Recording Level (from 0 to 1)" = "Recording Level (from 0 to 1)";

/* Title for sound recording screen */
"Recording Sound" = "Recording Sound";

/* No comment provided by engineer. */
"Remove active search filters" = "Remove active search filters";

/* No comment provided by engineer. */
"Remove current map area filter" = "Remove current map area filter";

/* No comment provided by engineer. */
"Remove my profile photo" = "මගේ පැතිකඩ ඡායාරූපය ඉවත් කරන්න";

/* No comment provided by engineer. */
"Removing..." = "ඉවත් කරමින්...";

/* No comment provided by engineer. */
"RESEARCH" = "පර්යේෂණ";

/* research data quality */
"Research Grade" = "පර්යේෂණ ශ්‍රේණියේ";

/* No comment provided by engineer. */
"Restricted to current map area" = "වත්මන් සිතියම් ප්‍රදේශයට සීමා කර ඇත";

/* No comment provided by engineer. */
"Resuming" = "Resuming";

/* Retake a photo */
"RETAKE" = "නැවත ගන්න";

/* Title for save new observation button */
"SAVE" = "සුරකින්න";

/* No comment provided by engineer. */
"Save Anyway" = "කෙසේ හෝ සුරකින්න";

/* Done button for recording observation sounds */
"Save Recording" = "Save Recording";

/* No comment provided by engineer. */
"Saving..." = "සුරකිමින්...";

/* No comment provided by engineer. */
"Search" = "සොයන්න";

/* placeholder for guide search field */
"Search for guide named..." = "මෙම නමැති මාර්ගෝපදේශය සොයන්න...";

/* placeholder for project search field */
"Search for project named..." = "මෙම නමැති ව්‍යාපෘතිය සොයන්න...";

/* No comment provided by engineer. */
"Searching for organisms..." = "ජීවීන් සොයමින්...";

/* No comment provided by engineer. */
"Searching for people..." = "පුද්ගලයන් සොයමින්...";

/* No comment provided by engineer. */
"Searching for place..." = "ස්ථානය සොයමින්...";

/* No comment provided by engineer. */
"Searching for project..." = "ව්‍යාපෘතිය සොයමින්...";

/* No comment provided by engineer. */
"Searching for recent observations in map area" = "සිතියම් ප්‍රදේශයේ මෑත නිරීක්ෂණ සඳහා සොයමින්";

/* No comment provided by engineer. */
"Searching for recent observations worldwide" = "ලොව පුරා මෑත නිරීක්ෂණ සඳහා සොයමින්";

/* No comment provided by engineer. */
"seen at '%@'" = "'%@' දී දැක ඇත";

/* No comment provided by engineer. */
"seen by '%@'" = "'%@' විසින් දැක ඇත";

/* default select title */
"Select" = "තෝරන්න ";

/* select taxon title */
"Select \"%@\"" = "\"%@\" තෝරන්න";

/* title for date selector */
"Select Date" = "දිනය තෝරන්න";

/* title for geoprivacy selector */
"Select Privacy" = "රහස්‍යතාවය තෝරන්න ";

/* No comment provided by engineer. */
"Selected Observation" = "තෝරාගත් නිරීක්ෂණය";

/* accessibility label for choose profile photo button */
"Set Profile Photo" = "පැතිකඩ ඡායාරූපය සකසන්න";

/* Notice while we're setting up an iNat account for them */
"Setting up iNaturalist account..." = "iNaturalist ගිණුම සකසමින්...";

/* accessibility label for settings button
   Title for the settings screen. */
"Settings" = "සැකසුම්";

/* No comment provided by engineer. */
"Share" = "Share";

/* Title for share new observation button */
"SHARE" = "බෙදාගන්න";

/* Prompt to sign in on the Me tab header. */
"Share your observations with the community." = "ඔබගේ නිරීක්ෂණ ප්‍රජාව සමඟ බෙදා ගන්න.";

/* label for iNaturalist store (tshirts/etc) action in settings. */
"Shop the iNat Store" = "iNat වෙළඳසැලෙන් මිලදී ගන්න";

/* label for show common names switch in settings */
"Show common names" = "Show common names";

/* No comment provided by engineer. */
"Show nearby suggestions only" = "Show nearby suggestions only";

/* label for scientific names shown first switch in settings */
"Show scientific names first" = "Show scientific names first";

/* No comment provided by engineer. */
"Sign in with Google" = "Sign in with Google";

/* No comment provided by engineer. */
"Sign out" = "වරන්න";

/* Title for button that allows users to sign up for a new iNat account */
"Sign Up" = "ලියාපදිංචි වන්න";

/* emphasis text for the 'switch to signup mode' button. must be a substring of the base text */
"Sign up now!" = "දැන් ලියාපදිංචි වන්න!";

/* No comment provided by engineer. */
"Signing Out" = "වරමින්";

/* skip button title */
"Skip ›" = "මඟ හරින්න ›";

/* Alert text for the data transfer consent checkbox during create account. */
"Some data privacy laws, like the European Union's General Data Protection Regulation (GDPR), require explicit consent to transfer personal information from their jurisdictions to other jurisdictions where the legal protection of this information is not considered adequate. As of 2020, the European Union no longer considers the United States to be a jurisdiction that provides adequate legal protection of personal information, specifically because of the possibility of the US government surveilling data entering the US. It is possible other jurisdictions may have the same opinion. Using iNaturalist requires the storage of personal information like your email address, all iNaturalist data is stored in the United States, and we cannot be sure what legal jurisdiction you are in when you are using iNaturalist, so in order to comply with privacy laws like the GDPR, you must acknowledge that you understand and accept this risk and consent to transferring your personal information to iNaturalist's servers in the US. To learn more about what information we collect and how we use it, please see our Privacy Policy and our Terms of Use. There is no way to have an iNaturalist account without storing personal information, so the only way to revoke this consent is to delete your account." = "Some data privacy laws, like the European Union's General Data Protection Regulation (GDPR), require explicit consent to transfer personal information from their jurisdictions to other jurisdictions where the legal protection of this information is not considered adequate. As of 2020, the European Union no longer considers the United States to be a jurisdiction that provides adequate legal protection of personal information, specifically because of the possibility of the US government surveilling data entering the US. It is possible other jurisdictions may have the same opinion. Using iNaturalist requires the storage of personal information like your email address, all iNaturalist data is stored in the United States, and we cannot be sure what legal jurisdiction you are in when you are using iNaturalist, so in order to comply with privacy laws like the GDPR, you must acknowledge that you understand and accept this risk and consent to transferring your personal information to iNaturalist's servers in the US. To learn more about what information we collect and how we use it, please see our Privacy Policy and our Terms of Use. There is no way to have an iNaturalist account without storing personal information, so the only way to revoke this consent is to delete your account.";

/* No comment provided by engineer. */
"Somewhere..." = "කොහේ හරි...";

/* Label for the sort selector in the explore leaderboard header. */
"Sort" = "අනුපිළිවෙළ";

/* credit for the wikipedia snippet that we include in inat taxon pages. first substitution is the article name, the second substitution is the license name. */
"Source: Wikipedia, %1$@, %2$@" = "මුලාශ්‍රය: විකිපීඩියා, %1$@, %2$@";

/* Species option for Explore leaderboard sorting. Must be short. */
"Species" = "විශේෂය";

/* species count on the explore leaderboard. */
"Species: %ld" = "Species: %ld";

/* observation count on explore leaderboard when the user has observations but not species in the leaderboard. */
"Species: *" = "Species: *";

/* Title for button in the explore tab that leads to the stats leaderboard. */
"Stats" = "සංඛ්‍යාලේඛන";

/* accessibility label for stop uploading button */
"Stop Uploading" = "උඩුගත කිරීම නවත්වන්න";

/* No comment provided by engineer. */
"Suggest ID" = "හඳුනාගැනීම යෝජනා කරන්න";

/* label for suggest species switch in settings */
"Suggest species" = "විශේෂයන් යෝජනා කරන්න";

/* No comment provided by engineer. */
"Suggestions based on observations and identifications provided by the iNaturalist community, including %@, %@, %@, and many others." = "%1$@, %2$@, %3$@, සහ තවත් බොහෝ අය ඇතුළුව iNaturalist ප්‍රජාව විසින් සපයන ලද නිරීක්ෂණ සහ හඳුනාගැනීම් මත පදනම් වූ යෝජනා.";

/* No comment provided by engineer. */
"Suggestions based on observations and identifications provided by the iNaturalist community." = "iNaturalist ප්‍රජාව විසින් සපයා ඇති නිරීක්ෂණ සහ හඳුනාගැනීම් මත පදනම් වූ යෝජනා.";

/* Title of me header when syncing. */
"Syncing..." = "සමමුහුර්ත වෙමින්...";

/* Category of iOS standard places for place search */
"System Places" = "System Places";

/* Tags (kind of like categories) are applied to the species in a guide, and allow the guide editor to group and organize the species in a guide. */
"TAGS" = "ටැග්";

/* taiwan partner */
"Taiwan: National Chiayi University and Taiwan Forestry Research Institute supporting iNaturalist Taiwan (taiwan.inaturalist.org)." = "Taiwan: National Chiayi University and Taiwan Forestry Research Institute supporting iNaturalist Taiwan (taiwan.inaturalist.org).";

/* No comment provided by engineer. */
"Take a photo" = "පින්තුරයක් ගන්න";

/* No comment provided by engineer. */
"Taxon %@ %@" = "Taxon %1$@ %2$@";

/* Title for description/comment when adding an ID */
"Tell Us Why" = "එයට හේතුව අපට කියන්න";

/* Emphasized part of the terms of service base text. */
"Terms of Service" = "සේවා කොන්දේසි";

/* Status message after a user sends info to iNat support after the database crashes early on launch. */
"Thank you for contacting iNat support. We'll get back to you as soon as we can." = "Thank you for contacting iNat support. We'll get back to you as soon as we can.";

/* error message when user fails to input prompted text correctly */
"The entered text doesn't match." = "The entered text doesn't match.";

/* No comment provided by engineer. */
"There are no observations for this project yet. Check back soon!" = "මෙම ව්‍යාපෘතිය සඳහා තවමත් නිරීක්ෂණ නොමැත. ළඟදීම නැවත පරීක්ෂා කරන්න!";

/* Error for no data transfer consent consent when making account. */
"There is no way to have an iNaturalist account without storing personal information in the United States." = "There is no way to have an iNaturalist account without storing personal information in the United States.";

/* Error for no personal info consent when making account. */
"There is no way to have an iNaturalist account without storing personal information." = "There is no way to have an iNaturalist account without storing personal information.";

/* Message when app fails to launch, the alert will have recovery suggestions */
"There was an error launching iNaturalist" = "There was an error launching iNaturalist";

/* Unresolvable and unknown error during observation upload. */
"There was an unexpected error." = "අනපේක්ෂිත දෝෂයක් ඇතිවිය.";

/* No comment provided by engineer. */
"This observation has been voted as Casual Grade by the iNaturalist community." = "මෙම නිරීක්ෂණය iNaturalist ප්‍රජාව විසින් අවිධිමත් ශ්‍රේණියේ ලෙස ඡන්දය ලබා දී ඇත.";

/* No comment provided by engineer. */
"This observation is Casual Grade because it has been voted captive or cultivated by the iNaturalist community." = "මෙම නිරීක්‍ෂණය අවිධිමත් ශ්‍රේණියේ, මන්දයත් එය iNaturalist ප්‍රජාව විසින් අල්ලාගත් හෝ වගා කළ ලෙස ඡන්දය දී ඇති බැවිනි.";

/* No comment provided by engineer. */
"This observation needs a date to be considered for Research Grade." = "මෙම නිරීක්ෂණය පර්යේෂණ ශ්‍රේණිය සඳහා සලකා බැලීමට දිනයක් අවශ්‍ය වේ.";

/* No comment provided by engineer. */
"This observation needs a location to be considered for Research Grade." = "මෙම නිරීක්ෂණය පර්යේෂණ ශ්‍රේණිය සඳහා සලකා බැලීමට ස්ථානයක් අවශ්‍ය වේ.";

/* No comment provided by engineer. */
"This observation needs a more specific consensus ID to be considered for Research Grade." = "මෙම නිරීක්ෂණය පර්යේෂණ ශ්‍රේණිය සඳහා සලකා බැලීමට වඩාත් නිශ්චිත සම්මුති හඳුනාගැනීමක් අවශ්‍ය වේ.";

/* No comment provided by engineer. */
"This observation needs a photo to be considered for Research Grade." = "මෙම නිරීක්ෂණය පර්යේෂණ ශ්‍රේණිය සඳහා සලකා බැලීමට ඡායාරූපයක් අවශ්‍ය වේ.";

/* No comment provided by engineer. */
"This observation needs more IDs from the iNat community to be considered for Research Grade." = "මෙම නිරීක්ෂණය පර්යේෂණ ශ්‍රේණිය සඳහා සලකා බැලීමට iNat ප්‍රජාවෙන් තවත් හඳුනාගැනීම් අවශ්‍ය වේ.";

/* No comment provided by engineer. */
"This project has no description." = "මෙම ව්‍යාපෘතියට විස්තරයක් නොමැත.";

/* No comment provided by engineer. */
"This project has no title." = "මෙම ව්‍යාපෘතියට මාතෘකාවක් නොමැත.";

/* No comment provided by engineer. */
"This will also remove your observations from this project." = "මෙමඟින් ඔබගේ නිරීක්ෂණත් මෙම ව්‍යාපෘතියෙන් ඉවත් කරනු ඇත.";

/* No comment provided by engineer. */
"This will destroy any changes/additions you've made from this app that haven't been synced with iNaturalist.org." = "මෙය iNaturalist.org සමඟ සමමුහුර්ත කර නොමැති මෙම යෙදුමෙන් ඔබ විසින් සිදු කරන ලද වෙනස්කම්/එකතු කිරීම් විනාශ කරනු ඇත.";

/* No comment provided by engineer. */
"This will download %@ of data so you can use this guide even when you don't have Internet access." = "මෙය %@ ක දත්ත බාගත කරනු ඇත, එවිට ඔබට අන්තර්ජාල ප්‍රවේශය නොමැති විටදී පවා මෙම මාර්ගෝපදේශය භාවිතා කළ හැකිය.";

/* Label for the time period selector in the explore leaderboard header. */
"Time Period" = "කාල සීමාව";

/* No comment provided by engineer. */
"Timeout" = "කාලය හමාරයි";

/* project title header */
"Title" = "මාතෘකාව";

/* Traditional inat type of project, where users have to manually add observations to the project. */
"Traditional Project" = "සාම්ප්‍රදායික ව්‍යාපෘතිය";

/* No comment provided by engineer. */
"Try again next time you're connected to the Internet." = "ඊළඟ වතාවේ ඔබ අන්තර්ජාලයට සම්බන්ධ වූ විට නැවත උත්සාහ කරන්න.";

/* button title to turn on autoupload */
"Turn On" = "ක්‍රියාත්මක කරන්න";

/* message of autoupload introduction alert view */
"Turn on Auto Upload and your observations will be automatically uploaded to iNaturalist." = "ස්වයංක්‍රීය උඩුගත කිරීම සක්‍රිය කරන්න, එවිට ඔබගේ නිරීක්ෂණ ස්වයංක්‍රීයව iNaturalist වෙත උඩුගත වේවි.";

/* Umbrella type of project, which contains other projects within it. */
"Umbrella Project" = "බහුවිස්තීර්ණ ව්‍යාපෘතිය";

/* Failure message when making an identification */
"Unable to add an identification to this observation. Please try again later." = "මෙම නිරීක්‍ෂණයට හඳුනාගැනීමක් එක් කළ නොහැක. කරුණාකර පසුව නැවත උත්සාහ කරන්න.";

/* No comment provided by engineer. */
"Unable to find location" = "ස්ථානය සොයාගත නොහැක";

/* place guess when we have lat/lng but it's not geocoded */
"Unable to find location name" = "ස්ථාන නාමය සොයාගත නොහැක";

/* Failure message when making an identification */
"Unable to identify this observation to that species. Please try again later." = "මෙම නිරීක්‍ෂණය එම විශේෂය දක්වා හඳුනාගත නොහැක. කරුණාකර පසුව නැවත උත්සාහ කරන්න.";

/* This is an explanation for when we get a 401 during upload/sync. */
"Unable to upload to iNaturalist, error 401 unauthenticated. Please contact help@inaturalist.org and try later." = "iNaturalist වෙත උඩුගත කළ නොහැක, දෝෂ 401 සත්‍යාපනය කර නොමැත. කරුණාකර help@inaturalist.org හා සම්බන්ධ වී පසුව උත්සාහ කරන්න.";

/* uk partner */
"United Kingdom: National Biodiversity Network Trust supporting iNaturalist United Kingdom (uk.inaturalist.org)." = "United Kingdom: National Biodiversity Network Trust supporting iNaturalist United Kingdom (uk.inaturalist.org).";

/* unknown taxon */
"Unknown" = "නොදනී";

/* Text shown in place of a post author when a post has no known author */
"Unknown author" = "නොදන්නා කතුවරයෙකි";

/* Message body when we don't know the error */
"Unknown error" = "නොදන්නා දෝෂයකි";

/* Unknown error */
"Unknown error while making an identification." = "හඳුනාගැනීමක් කරන අතරතුර ඇතිවූ නොදන්නා දෝෂයකි.";

/* message to the user when we get an unknown error. the %ld will be a status code */
"Unknown Error: %ld" = "නොදන්නා දෝෂයකි: %ld";

/* Title displayed for a journal post when the post has no title */
"Untitled Post" = "මාතෘකාවක් නැති සටහනක්";

/* Title for progress view when migrating db */
"Updating database..." = "දත්ත සමුදාය යාවත්කාලීන කරමින්...";

/* No comment provided by engineer. */
"Updating..." = "යාවත්කාලීන කරමින්...";

/* accessibility labelf for upload button
   Title for upload button. */
"Upload" = "උඩුගත කරන්න";

/* No comment provided by engineer. */
"Upload Error" = "උඩුගත කිරීමේ දෝෂයකි";

/* upload failed alert title */
"Upload Failed" = "උඩුගත කිරීම අසාර්ථක විය";

/* No comment provided by engineer. */
"Upload this observation" = "Upload this observation";

/* No comment provided by engineer. */
"Upload this observation to enable comments & identifications." = "අදහස් සහ හඳුනාගැනීම් සක්‍රීය කිරීම සඳහා මෙම නිරීක්‍ෂණය උඩුගත කරන්න.";

/* No comment provided by engineer. */
"Upload this observation to enable faves." = "ප්‍රියතමයන් සක්‍රීය කිරීම සඳහා මෙම නිරීක්ෂණය උඩුගත කරන්න.";

/* subtitle for observation while it's uploading. */
"Uploading..." = "උඩුගත කරමින්...";

/* label for username field in settings
   The desired username during signup. */
"Username" = "පරිශීලක නාමය";

/* users can login with their username or their email address. */
"Username or email" = "පරිශීලක නාමය හෝ විද්‍යුත් තැපෑල";

/* Title for version section of settings. */
"Version" = "අනුවාදය";

/* label for start video tutorial action in settings. */
"Video Tutorial" = "වීඩියෝ නිබන්ධනය";

/* button to view privacy policy */
"View Privacy Policy" = "View Privacy Policy";

/* unknown taxon subtitle when suggestions are available */
"View suggestions" = "යෝජනා බලන්න";

/* button to view terms of use */
"View Terms of Use" = "View Terms of Use";

/* Subtitle below image for projects tutorial screen. The string is the URL for iNat (or partner site) */
"Visit %@ to create your own projects" = "ඔබේම ව්‍යාපෘති නිර්මාණය කිරීමට %@ වෙත පිවිසෙන්න";

/* Subtitle below image for guides tutorial screen */
"Visit iNaturalist.org to create your own guides" = "ඔබේම මාර්ගෝපදේශ නිර්මාණය කිරීමට iNaturalist.org වෙත පිවිසෙන්න";

/* basis for a species suggestion */
"Visually Similar" = "දෘශ්‍යමය වශයෙන් සමාන";

/* basis for a species suggestion */
"Visually Similar / Expected Nearby" = "Visually Similar / Expected Nearby";

/* Subtitle for observation when waiting to upload. */
"Waiting to upload..." = "උඩුගත කිරීමට බලා සිටී...";

/* inat ios translators with more than 200 strings contributed, alphabetically */
"We are grateful for the translation assistance provided by the crowdin.com community, especially: Catherine B, Vladimir Belash, cgalindo, danieleseglie, Eduardo Martínez, naofum, Foss, jacquesboivin, Sungmin Ji, katunchik, NCAA, oarazy, sudachi, T.O, testamorta, and vilseskog. To join the iNaturalist iOS translation team, please visit https://crowdin.com/project/inaturalistios." = "Crowdin.com ප්‍රජාව විසින් සපයනු ලබන පරිවර්තන සහාය සඳහා අපි කෘතඥ වෙමු, විශේෂයෙන්ම: Catherine B, Vladimir Belash, cgalindo, danieleseglie, Eduardo Martínez, naofum, Foss, jacquesboivin, Sungmin Ji, katunchik, NCAA, oarazy, sudachi, T.O, testamorta, සහ vilseskog. iNaturalist iOS පරිවර්තන කණ්ඩායමට සම්බන්ධ වීමට කරුණාකර https://crowdin.com/project/inaturalistios වෙත පිවිසෙන්න.";

/* No comment provided by engineer. */
"We don't have permission from iOS to use your location." = "ඔබගේ ස්ථානය භාවිතා කිරීමට අපට iOS වෙතින් අවසර නොමැත.";

/* Alert text for the personal information checkbox during create account. */
"We store personal information like usernames and email addresses in order to manage accounts on this site, and to comply with privacy laws, we need you to check this box to indicate that you consent to this use of personal information. To learn more about what information we collect and how we use it, please see our Privacy Policy and our Terms of Use. There is no way to have an iNaturalist account without storing personal information, so the only way to revoke this consent is to delete your account." = "We store personal information like usernames and email addresses in order to manage accounts on this site, and to comply with privacy laws, we need you to check this box to indicate that you consent to this use of personal information. To learn more about what information we collect and how we use it, please see our Privacy Policy and our Terms of Use. There is no way to have an iNaturalist account without storing personal information, so the only way to revoke this consent is to delete your account.";

/* base error message when icloud photo fetch fails */
"We're not able to fetch your photo from iCloud: %@" = "We're not able to fetch your photo from iCloud: %@";

/* No comment provided by engineer. */
"We're not confident enough to make a recommendation, but here are our top suggestions." = "We're not confident enough to make a recommendation, but here are our top suggestions.";

/* No comment provided by engineer. */
"We're not confident enough to make a recommendation." = "We're not confident enough to make a recommendation.";

/* comment for common ancestor suggestion. %1$@ is the rank name (order, family), whereas %2$@ is the actual rank (Animalia, Insecta) */
"We're pretty sure this is in the %1$@ %2$@." = "අපට හොඳටම විශ්වාසයි මෙය %1$@ %2$@ තුළ ඇති බව.";

/* unknown taxon title */
"What did you see?" = "ඔබ මොනවද දුටුවේ?";

/* title for alert explaining what captive means */
"What does captive / cultivated mean?" = "අල්ලාගත් / වගා කළ යන්නෙන් අදහස් කරන්නේ කුමක්ද?";

/* No comment provided by engineer. */
"Which organism?" = "කුමන ජීවියාද?";

/* No comment provided by engineer. */
"Which person?" = "කුමන පුද්ගලයාද?";

/* No comment provided by engineer. */
"Which place?" = "කුමන ස්ථානයද?";

/* No comment provided by engineer. */
"Which project?" = "කුමන ව්‍යාපෘතියද?";

/* No comment provided by engineer. */
"Whoops" = "අපොයි";

/* Default upload failure alert title. */
"Whoops!" = "අපොයි!";

/* No comment provided by engineer. */
"Without a date, this observation may be very hard for others to identify accurately, and will never attain research grade." = "දිනයක් නොමැතිව, මෙම නිරීක්ෂණය අන් අයට නිවැරදිව හඳුනා ගැනීම ඉතා අපහසු විය හැකි අතර කිසි විටෙකත් පර්යේෂණ ශ්‍රේණිය ලබා නොගනී.";

/* No comment provided by engineer. */
"Without a location, this observation will be very hard for others to identify and will never attain research grade." = "ස්ථානයක් නොමැතිව, මෙම නිරීක්ෂණය අන් අයට හඳුනා ගැනීම ඉතා අපහසු වන අතර කිසි විටෙකත් පර්යේෂණ ශ්‍රේණිය ලබා නොගනී.";

/* No comment provided by engineer. */
"Without at least one photo or sound, this observation will be impossible for others to help identify." = "Without at least one photo or sound, this observation will be impossible for others to help identify.";

/* message for alert when db migration has a problem */
"Would you like to share your migration report with help@inaturalist.org for debugging?" = "දෝෂහරණය සඳහා ඔබගේ සංක්‍රමණ වාර්තාව help@inaturalist.org සමඟ බෙදා ගැනීමට ඔබ කැමතිද?";

/* positive response to binary choice, yes or no */
"Yes" = "ඔව්";

/* change network partner button */
"Yes, change my affiliation" = "ඔව්, මගේ අනුබද්ධතාවය වෙනස් කරන්න";

/* No comment provided by engineer. */
"Yes, delete this observation" = "ඔව්, මෙම නිරීක්ෂණය මකන්න";

/* cc licensing consent checkbox label */
"Yes, license my content so scientists can use my data." = "Yes, license my content so scientists can use my data.";

/* failure message when the user tries to change their network affiliation too often */
"You can only change your network affiliation once per day." = "ඔබට ඔබගේ ජාල අනුබද්ධතාවය වෙනස් කළ හැක්කේ දිනකට එක් වරක් පමණි.";

/* 403 forbidden message */
"You don't have permission to do that. Your account may have been suspended. Please contact help@inaturalist.org" = "ඔබට එය කිරීමට අවසර නැත. ඔබගේ ගිණුම අත්හිටුවා තිබිය හැක. කරුණාකර help@inaturalist.org හා සම්බන්ධ වන්න";

/* 403 forbidden message */
"You don't have permission to do that. Your account may have been suspended. Please contact help@inaturalist.org." = "ඔබට එය කිරීමට අවසර නැත. ඔබගේ ගිණුම අත්හිටුවා තිබිය හැක. කරුණාකර help@inaturalist.org හා සම්බන්ධ වන්න.";

/* No comment provided by engineer. */
"You must be connected to the Internet to do this." = "මෙය සිදු කිරීම සඳහා ඔබ අන්තර්ජාලයට සම්බන්ධ විය යුතුය.";

/* No comment provided by engineer. */
"You must be connected to the Internet to upload to iNaturalist.org" = "iNaturalist.org වෙත උඩුගත කිරීම සඳහා ඔබ අන්තර්ජාලයට සම්බන්ධ විය යුතුය";

/* No comment provided by engineer. */
"You must be logged in to access projects." = "ව්‍යාපෘති වෙත ප්‍රවේශ වීම සඳහා ඔබ ඇතුල් වී සිටිය යුතුය.";

/* Unspecific signup prompt reason. */
"You must be logged in to do that." = "එය සිදු කිරීම සඳහා ඔබ ඇතුල් වී සිටිය යුතුය.";

/* Signup prompt reason when user tries to sync user projects. */
"You must be logged in to sync user projects." = "පරිශීලක ව්‍යාපෘති සමමුහුර්ත කිරීම සඳහා ඔබ ඇතුල් වී සිටිය යුතුය.";

/* This is an explanation for why the upload button triggers a login prompt. */
"You must be logged in to upload." = "උඩුගත කිරීම සඳහා ඔබ ඇතුල් වී සිටිය යුතුය.";

/* No comment provided by engineer. */
"You must be logged in!" = "ඔබ ඇතුල් වී සිටිය යුතුය!";

/* Account is required error message */
"You must be logged in." = "ඔබ ඇතුල් වී සිටිය යුතුය.";

/* Reason text for signup prompt while trying to join a project. */
"You must be signed in to join a project." = "ව්‍යාපෘතියකට සම්බන්ධ වීමට ඔබ ලියාපදිංචි වී සිටිය යුතුය.";

/* Reauthentication to delete account tip. */
"You must re-authenticate to delete your account." = "You must re-authenticate to delete your account.";

/* 401 unauthorized message when signed out */
"You need to log in to do that." = "You need to log in to do that.";

/* No comment provided by engineer. */
"You will receive updates once you've uploaded observations." = "ඔබ නිරීක්ෂණ උඩුගත කළ පසු ඔබට යාවත්කාලීනයන් ලැබෙනු ඇත.";

/* Title for account section of settings. */
"Your Account" = "ඔබගේ ගිණුම";

/* account deletion confirmation msg */
"Your account has been deleted." = "Your account has been deleted.";

/* No comment provided by engineer. */
"Your Guides" = "ඔබේ මාර්ගෝපදේශයන්";

/* 401 unauthorized message when signed in */
"Your login credentials appear to have changed. Please go to Settings to sign out and then sign in again." = "Your login credentials appear to have changed. Please go to Settings to sign out and then sign in again.";

/* Placeholder for free text observation field value */
"Your response here" = "ඔබේ ප්‍රතිචාරය මෙහි";
